 HELLO:   PROCEDURE OPTIONS (MAIN);
       /* A PROGRAM TO OUTPUT HELLO WORLD */
       %include hw;
       PUT SKIP LIST('HELLO WORLD!');
 END HELLO;
