       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID. HW.                                                          
       PROCEDURE DIVISION.                                                      
           COPY "hw.cpy".                                                       
           STOP RUN.                                                            
