       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID. HW.                                                          
       PROCEDURE DIVISION.                                                      
           COPY "HW".                                                
           STOP RUN.                                                            
