 /* HELLO program calls external subroutine 'print' */
 HELLO:   PROCEDURE OPTIONS (MAIN);
       /* A PROGRAM TO OUTPUT HELLO WORLD */
       %include print;
       Declare print entry external;
       Declare greeting type Greeting;
       greeting.text = 'Hello';
       call print(greeting);
 END HELLO;
