 /*HELLO program calls external subroutine 'print' to print greeting*/
 HELLO:   PROCEDURE OPTIONS (MAIN);
       %include print;
       declare greeting type Greeting;
       greeting.text = 'Hello';
       call print(greeting);
 END HELLO;
