 /*HELLO program calls external subroutine 'print' to print greeting*/
 HELLO:   PROCEDURE OPTIONS (MAIN);
       %include print;
       declare Greeting type Greeting;
       Greeting.Text = 'Hello';
       call print(Greeting);
 END HELLO;
